let starttime = (90d); 
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType in~ ("HoldCreated", "HoldUpdated") 
| extend CaseName = tostring(RawEventData.Case) 
| extend CaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value) 
| extend ExchangeHoldLocations = tostring(RawEventData.ExchangeLocations) 
| extend PublicFolderHoldLocations = tostring(RawEventData.PublicFolderLocations) 
| extend SharepointHoldLocations = tostring(RawEventData.SharepointLocations) 
| extend QueryBasedHoldText = tostring(RawEventData.Query) 
| extend HoldId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[1].Value) 
| extend AdminAppliedHolds = tostring(RawEventData.UserId) 
| project TimeGenerated,CaseName,CaseId,ExchangeHoldLocations,SharepointHoldLocations,PublicFolderHoldLocations,QueryBasedHoldText,HoldId,AdminAppliedHolds,ActionType 
| sort by TimeGenerated asc