let starttime = (90d); 
let AlleDiscoveryActions=  
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType == "CaseAdded"  
| extend AllCaseIDs = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value)  
| extend CaseName = tostring(RawEventData.Case)  
| extend ContactEmail = tostring(RawEventData.ContactEmail)  
| extend CustodianId = tostring(RawEventData.CustodianId)  
| extend CustodianTimeAdded = tostring(RawEventData.CreationTime)  
| extend CustodianCaseId = tostring(RawEventData.CaseId)  
| extend NonCustodianSourceCreationTime = tostring(RawEventData.CreationTime)  
| extend NonCustodianSourceId = tostring(RawEventData.NonCustodianSourceId)  
| extend NonCustodianSourceName = tostring(RawEventData.Name)  
| extend NonCustodianCaseId = tostring(RawEventData.CaseId)  
| extend CollectionName = tostring(RawEventData.Name)  
| extend CollectionCreationTime = tostring(RawEventData.CreationTime)  
| extend CollectionTargetedQueryText = tostring(RawEventData.QueryText)  
| extend CollectionTargetNonCustodianSourceIds = tostring(parse_json(tostring(RawEventData.NonCustodianSourceIds)))  
| extend CollectionTargetCustodianLocation = tostring(parse_json(tostring(RawEventData.Sources))[0].Location)  
| extend ExportItemReportCaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[3].Value)  
| where isnotempty(AllCaseIDs)  
| where isnotempty(CaseName)  
| project TimeGenerated, ActionType, AllCaseIDs, CaseName, ContactEmail, CustodianId, CustodianTimeAdded, CustodianCaseId, NonCustodianSourceName, NonCustodianSourceId, NonCustodianSourceCreationTime, NonCustodianCaseId, CollectionCreationTime, CollectionName, CollectionTargetCustodianLocation, CollectionTargetedQueryText, CollectionTargetNonCustodianSourceIds, ExportItemReportCaseId  
| summarize make_set(AllCaseIDs);  
CloudAppEvents  
| where RawEventData has_any (eDiscoveryActions)  
| extend AllCaseIDs = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value)  
| extend CaseName = tostring(RawEventData.Case)  
| extend ContactEmail = tostring(RawEventData.ContactEmail)  
| extend CustodianId = tostring(RawEventData.CustodianId)  
| extend CustodianTimeAdded = tostring(RawEventData.CreationTime)  
| extend CustodianCaseId = tostring(RawEventData.CaseId)  
| extend NonCustodianSourceCreationTime = tostring(RawEventData.CreationTime)  
| extend NonCustodianSourceId = tostring(RawEventData.NonCustodianSourceId)  
| extend NonCustodianSourceName = tostring(RawEventData.Name)  
| extend NonCustodianCaseId = tostring(RawEventData.CaseId)  
| extend CollectionName = tostring(RawEventData.Name)  
| extend CollectionCreationTime = tostring(RawEventData.CreationTime)  
| extend CollectionTargetedQueryText = tostring(RawEventData.QueryText)  
| extend CollectionTargetNonCustodianSourceIds = tostring(parse_json(tostring(RawEventData.NonCustodianSourceIds)))  
| extend CollectionTargetCustodianLocation = tostring(parse_json(tostring(RawEventData.Sources))[0].Location)  
| extend ExportItemReportCaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[3].Value)  
| project TimeGenerated, ActionType, AllCaseIDs, CaseName, ContactEmail, CustodianId, CustodianTimeAdded, CustodianCaseId, NonCustodianSourceName, NonCustodianSourceId, NonCustodianSourceCreationTime, NonCustodianCaseId, CollectionCreationTime, CollectionName, CollectionTargetCustodianLocation, CollectionTargetedQueryText, CollectionTargetNonCustodianSourceIds, ExportItemReportCaseId  
| sort by TimeGenerated, AllCaseIDs, CaseName, CustodianCaseId, NonCustodianCaseId 