let watchlistMIPLabelling = (_GetWatchlist('MIPLabelling')) 
| extend OldSensitivityLabelId=tostring(OldSensitivityLabelId)
| extend SensitivityLabelId=tostring(SensitivityLabelId)
| distinct SensitivityLabelId, LabelIdentifier;
CloudAppEvents
| where TimeGenerated > ago(90d)
| where ActionType contains_cs ("Label")
| extend SensitivityLabelJustificationText = tostring(RawEventData.SensitivityLabelJustificationText)
| where (isnotempty(SensitivityLabelJustificationText))
| extend ActionSource = tostring(parse_json(tostring(RawEventData.SensitivityLabelEventData)).ActionSource)
| extend LabelEventType = tostring(parse_json(tostring(RawEventData.SensitivityLabelEventData)).LabelEventType)
| extend OldSensitivityLabelId = tostring(parse_json(tostring(RawEventData.SensitivityLabelEventData)).OldSensitivityLabelId)
| extend OldSensitivityLabelOwnerEmail = tostring(parse_json(tostring(RawEventData.SensitivityLabelEventData)).OldSensitivityLabelOwnerEmail)
| extend SensitivityLabelId = tostring(parse_json(tostring(RawEventData.SensitivityLabelEventData)).SensitivityLabelId)
| extend SensitivityLabelOwnerEmail = tostring(parse_json(tostring(RawEventData.SensitivityLabelEventData)).SensitivityLabelOwnerEmail)
| extend ObjectId = tostring(RawEventData.ObjectId)
| lookup watchlistMIPLabelling on SensitivityLabelId
| lookup watchlistMIPLabelling on $left.OldSensitivityLabelId==$right.SensitivityLabelId
| project TimeGenerated, SensitivityLabelJustificationText, SensitivityLabelId, OldSensitivityLabelId, ["OriginalLabel"]=LabelIdentifier1, ["NewLabel"]=LabelIdentifier, SensitivityLabelOwnerEmail, OldSensitivityLabelOwnerEmail, ActionType, LabelEventType, ObjectId, AccountDisplayName