let starttime = (90d); 
let AlleDiscoveryActions=  
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType == "CaseAdded" 
| extend CaseID = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value) 
| where isnotempty( CaseID) 
| summarize make_set(CaseID); 
CloudAppEvents 
| where RawEventData has_any (AlleDiscoveryActions) 
| project TimeGenerated,ActionType,AccountDisplayName 
| sort by TimeGenerated asc 
