let aCaseName = "Add Your Case Name"; 
let bCaseId = "Add Your Case Id"; 
let starttime = (90d); 
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType in~ ("HoldCreated", "HoldUpdated") 
| extend CaseName = tostring(RawEventData.Case) 
| extend CaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value) 
| extend ExchangeLocationsOnHold = tostring(RawEventData.ExchangeLocations) 
| extend SharepointLocationsOnHold = tostring(RawEventData.SharepointLocations) 
| extend CaseNameAndHoldNameOrID = tostring(RawEventData.ObjectId) 
| extend AdminAppliedHolds = tostring(RawEventData.UserId) 
| extend QueryBasedHoldText = tostring(RawEventData.Query) 
| where CaseName in (aCaseName) or CaseId in (bCaseId) 
| project TimeGenerated,CaseName,CaseId,ExchangeLocationsOnHold,SharepointLocationsOnHold,CaseNameAndHoldNameOrID,AdminAppliedHolds,QueryBasedHoldText,ActionType 
| sort by TimeGenerated 
