let starttime = (90d); 
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType in~ ("CaseAdded", "CaseMemberUpdated") 
| extend CaseName = tostring(RawEventData.Case) 
| extend NewCaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value) 
| extend OthereDiscoveryAdmins = tostring(parse_json(tostring(RawEventData.Parameters))[0].Value) 
| extend eDiscoveryAdmin = tostring(RawEventData.UserId) 
| project TimeGenerated,CaseName,NewCaseId,eDiscoveryAdmin,OthereDiscoveryAdmins,ActionType 
| sort by TimeGenerated 
| sort by TimeGenerated asc