let aCaseName = "Insert Case Name"; 
let bStampedCaseId = "Insert Case Id"; 
let starttime = (90d); 
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType in~ ("CaseAdded","NonCustodianSourceCreated") 
| extend CaseName = tostring(RawEventData.Case) 
| extend CaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value) 
| extend StampedCaseId = tostring(RawEventData.CaseId) 
| extend StampedCaseId = tostring(RawEventData.CaseId) 
| where CaseName in (aCaseName) or StampedCaseId in (bStampedCaseId) 
| extend eDiscoveryAdmin = tostring(RawEventData.UserId) 
| extend NonCustodianSourceName = tostring(RawEventData.Name) 
| extend NonCustodianSourceId = tostring(RawEventData.NonCustodianSourceId) 
| project TimeGenerated,CaseName,CaseId,StampedCaseId,eDiscoveryAdmin,NonCustodianSourceName,NonCustodianSourceId,ActionType 
| sort by CaseName desc 
