let starttime = (90d); 
CloudAppEvents 
| where TimeGenerated >ago(starttime) 
| where ActionType in ("CaseAdded","CustodianCreated") 
| extend CaseName = tostring(RawEventData.Case) 
| extend NewCaseId = tostring(parse_json(tostring(RawEventData.ExtendedProperties))[0].Value) 
| extend StampedCaseId = tostring(RawEventData.CaseId) 
| extend eDiscoveryAdmin = tostring(RawEventData.UserId) 
| extend CustodianContactEmail = tostring(RawEventData.ContactEmail) 
| extend CustodianId = tostring(RawEventData.CustodianId) 
| order by CaseName,NewCaseId,StampedCaseId,CustodianId 
| project TimeGenerated,CaseName,NewCaseId,StampedCaseId,eDiscoveryAdmin,CustodianContactEmail,CustodianId,ActionType 
| sort by TimeGenerated asc 